app/controllers/categorias_controller.rb

  def some
    tipo = params[:tipo]
    instance_variable_set "@#{tipo.downcase}", tipo.constantize.find(params[:id])
    if tipo.eql? "Concepto"
        @categorias = Categoria.paginate :all, :joins => :conceptos, :conditions => {:categorias_conceptos => {:concepto_id => params[:id]}}, :page => params[:page]
---
SELECT "categorias".* FROM "categorias" INNER JOIN "categorias_conceptos" ON "categorias_conceptos".categoria_id = "categorias".id INNER JOIN "conceptos" ON "conceptos".id = "categorias_conceptos".concepto_id WHERE ("categorias_conceptos"."concepto_id" = '4') LIMIT 3 OFFSET 0
SELECT count(*) AS count_all FROM "categorias" INNER JOIN "categorias_conceptos" ON "categorias_conceptos".categoria_id = "categorias".id INNER JOIN "conceptos" ON "conceptos".id = "categorias_conceptos".concepto_id WHERE ("categorias_conceptos"."concepto_id" = '1')

  def show
    @obj = Categoria.find(params[:id])
---
SELECT * FROM "categorias" WHERE ("categorias"."id" = 0)

  def edit
    @categoria = Categoria.find(params[:id])
---
SELECT * FROM "categorias" WHERE ("categorias"."id" = 1)