app/controllers/conceptos_controller.rb

  def index
    @conceptos = Concepto.paginate :all, :page => params[:page]
---
SELECT * FROM "conceptos" LIMIT 3 OFFSET 0
SELECT count(*) AS count_all FROM "conceptos"

  def some
    tipo = params[:tipo]
    instance_variable_set "@#{tipo.downcase}", tipo.constantize.find(params[:id])
    if tipo.eql? "Servicio"
      @conceptos = Concepto.paginate :all, :joins => :servicios, :conditions => {:servicios => {:id => params[:id]}}, :page => params[:page]
    elsif tipo.eql? "Categoria"
      @conceptos = Concepto.paginate :all, :joins => :categorias, :conditions => {:categorias_conceptos => {:categoria_id => params[:id]}}, :page => params[:page]
---
SELECT "conceptos".* FROM "conceptos" INNER JOIN "servicios" ON servicios.concepto_id = conceptos.id WHERE ("servicios"."concepto_id" = '3') LIMIT 3 OFFSET 0
SELECT "conceptos".* FROM "conceptos" INNER JOIN "categorias_conceptos" ON "categorias_conceptos".concepto_id = "conceptos".id INNER JOIN "categorias" ON "categorias".id = "categorias_conceptos".categoria_id WHERE ("categorias_conceptos"."categoria_id" = '1') LIMIT 3 OFFSET 0
SELECT count(*) AS count_all FROM "conceptos" INNER JOIN "categorias_conceptos" ON "categorias_conceptos".concepto_id = "conceptos".id INNER JOIN "categorias" ON "categorias".id = "categorias_conceptos".categoria_id WHERE ("categorias_conceptos"."categoria_id" = '1')

  def edit
    @concepto = Concepto.find(params[:id])
---
SELECT * FROM "conceptos" WHERE ("conceptos"."id" = 1)