app/controllers/especializados_controller.rb

   def show
      @especializado = Especializado.find(params[:id])
---
SELECT * FROM "especializados" WHERE ("especializados"."id" = 0)

   def edit
     @especializado = Especializado.find(params[:id])
---
SELECT * FROM "especializados" WHERE ("especializados"."id" = 1)

   def create
     @especializado = Especializado.new(params[:especializado])

     respond_to do |format|
       if @especializado.save
---
INSERT INTO "especializados" ("updated_at", "plaza_id", "costo", "servicio_id", "activo", "created_at") VALUES('2009-05-13 17:49:31.287704', NULL, 789.0, 2, 't', '2009-05-13 17:49:31.287704')

   def update
     @especializado = Especializado.find(params[:id])

     respond_to do |format|
       if @especializado.update_attributes(params[:especializado])
---
SELECT * FROM "especializados" WHERE ("especializados"."id" = 1)
UPDATE "especializados" SET "servicio_id" = 3, "updated_at" = '2009-05-13 17:46:14.722673' WHERE "id" = 1