app/controllers/estados_controller.rb

SELECT * FROM "estados" WHERE ("estados"."id" = 1)
---
  def edit
    @estado = Estado.find(params[:id])