app/controllers/incorporados_controller.rb

  def show
     @incorporado = Incorporado.find(params[:id])
---
SELECT * FROM "incorporados" WHERE ("incorporados"."id" = 0)

  def edit
    @incorporado = Incorporado.find(params[:id])
---
SELECT * FROM "incorporados" WHERE ("incorporados"."id" = 1)