app/controllers/paquetes_controller.rb

SELECT * FROM "paquetes" LIMIT 3 OFFSET 0
---
  def index
    @paquetes = Paquete.paginate :all, :page => params[:page]

SELECT * FROM "paquetes" WHERE ("paquetes"."id" = 0)
---
  def show
    @obj = Paquete.find(params[:id])

SELECT * FROM "categorias" WHERE ("categorias"."id" = 1)
---
  def new
    @paquete = Paquete.new
    @categorias = Categoria.find :all

SELECT * FROM "paquetes" WHERE ("paquetes"."id" = 1)
SELECT * FROM "categorias" WHERE ("categorias"."id" = 1)
---
  def edit
    @paquete = Paquete.find(params[:id])
    @categorias = Categoria.find :all

INSERT INTO "paquetes" ("updated_at", "nombre", "created_at") VALUES('2009-05-13 18:51:23.353361', 'Calzones de Cuquita', '2009-05-13 18:51:23.353361')
---
  def create
    @paquete = Paquete.new(params[:paquete])
    params[:incorporados] = session[:incorporados_paquete]

    @paquete.agrega_desde(params)

    respond_to do |format|
      if @paquete.save

SELECT * FROM "paquetes" WHERE ("paquetes"."id" = 2)
---
  def update
    @paquete = Paquete.find(params[:id])