app/controllers/plazas_controller.rb

SELECT * FROM "plazas" LIMIT 3 OFFSET 0
SELECT count(*) AS count_all FROM "plazas"
---
  def index
    @plazas = Plaza.paginate :all, :page => params[:page]

SELECT "plazas".* FROM "plazas" INNER JOIN "paquetes_plazas" ON "paquetes_plazas".plaza_id = "plazas".id INNER JOIN "paquetes" ON "paquetes".id = "paquetes_plazas".paquete_id WHERE ("paquetes_plazas"."paquete_id" = '2') LIMIT 3 OFFSET 0
SELECT * FROM "paquetes" WHERE ("paquetes"."id" = 2)
---
  def some
    tipo = params[:tipo]
    instance_variable_set "@#{tipo.downcase}", tipo.constantize.find(params[:id])
    if tipo.eql? "Paquete"
      @plazas = Plaza.paginate :all, :joins => :paquetes, :conditions => {:paquetes_plazas => {:paquete_id => params[:id]}}, :page => params[:page]
    elsif tipo.eql? "Estado"
      @plazas = eval("Plaza.paginate_by_#{tipo.downcase}_id @#{tipo.downcase}.id, :page => params[:page]")
      # para modelos: [especializado, usuario]
    else
      @plazas = Plaza.paginate :all, :joins => "#{tipo.downcase.pluralize}".to_sym, :conditions => {"#{tipo.downcase.pluralize}".to_sym => {:id => params[:id]}}, :page => params[:page]

SELECT * FROM "plazas" WHERE ("plazas"."id" = 1)
---
  def show
    @obj = Plaza.find(params[:id])

SELECT * FROM "plazas" WHERE ("plazas"."id" = 1)
SELECT * FROM "paquetes"
SELECT * FROM "categorias" WHERE ("categorias"."id" = 3)
SELECT * FROM "usuarios" WHERE ("usuarios".responsabilidad_id = 1 AND "usuarios".responsabilidad_type = 'Plaza')
---
  def edit
    @plaza = Plaza.find(params[:id])
    @paquetes = Paquete.paginate :all, :page => params[:page], :per_page => 3
    @categorias = Categoria.find :all

    @usuarios = Usuario.paginate :all, :page => params[:page], :per_page => 5

SELECT * FROM "plazas" WHERE ("plazas"."id" = 1)
---
  def update
    @plaza = Plaza.find(params[:id])