app/controllers/servicios_controller.rb

SELECT * FROM "servicios" LIMIT 3 OFFSET 0
SELECT count(*) AS count_all FROM "servicios"
---
  def index
    @servicios = Servicio.paginate :all, :page => params[:page]

SELECT * FROM "servicios" WHERE ("servicios"."id" = 0)
---
  def show
    @obj = Servicio.find(params[:id])

SELECT * FROM "servicios" WHERE ("servicios"."id" = 1)
---
  def edit
    @servicio = Servicio.find(params[:id])

INSERT INTO "servicios" ("categoria_id", "concepto_id", "updated_at", "detalles", "created_at") VALUES(1, 1, '2009-05-14 06:49:15.388446', 'Dar de alta a un cliente en el servicio de internet.', '2009-05-14 06:49:15.388446')
---
  def create
    @servicio = Servicio.new(params[:servicio])

    respond_to do |format|
      if @servicio.save

SELECT * FROM "categorias" WHERE ("categorias"."id" = 4)
---
  def update_conceptos
    categoria = Categoria.find params[:categoria_servicio].gsub(/\D/,'')