app/controllers/tableros_controller.rb

  def index
    @usuario = Usuario.find(session[:usuario_id])
---
SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 2)

  def lista_ajax
    @plaza = Plaza.find params[:id].gsub(/\D/,'')
---
SELECT * FROM "plazas" WHERE ("plazas"."id" = 1)